DEFAULT_INTENT = "other"

INTENT_RULES = {
    "abusive_or_spam": [
        "غبي", "اغبياء", "زفت", "نصب", "احتيال", "حرامية",
        "سرقة", "قذر", "سبام", "اهانة", "لعنة",
        "إساءة", "شتائم", "تهديد", "تصعيد"
    ],

    "refund_request": [
        "استرجاع", "استرداد", "ارجاع", "رجوع",
        "مبلغ", "فلوس", "رسوم",
        "تامين", "تأمين", "تعويض",
        "إلغاء",
        "غرفة", "غير", "مطابقة",
        "وصف", "مختلف",
        "حجز", "مؤكد",
        "جاهزة", "جاهزه",
    ],

    "delivery_issue": [
        "متاخر", "متأخر",
        "تاخير", "تأخير",
        "انتظار", "انتظرت",
        "توصيل", "وصل", "جاهز",
        "الاستقبال", "يرد",
        "مايرد",
        "مستلزمات", "الحمام",
    ],

    "payment_issue": [
        "دفع", "الدفع",
        "بطاقة", "بطاقه",
        "سداد",
        "حساب",
        "معاملة", "معامله",
        "مرفوضة", "مرفوضه",
        "فشل",
        "مرتين",
        "مكرر",
        "كشف",
        "charge",
        "dispute",
        "اختلاف",
        "مواقف",
        "إضافية",
        "اضافية",
        "رسوم",
        "السعر",
    ],

    "product_quality": [
        "مكسور", "متسخ", "وسخ",
        "تالف", "خربان",
        "رائحة", "رائحه",
        "كريهة", "كريهه",
        "جودة", "جوده",
        "نظافة", "النظافة",
        "اثاث", "أثاث",

        "حمام", "incredible"
        "سجاد","غرفة",
        "متعلقات", "نزيل", "سابق",

        "تكييف",
        "مياه", "ساخنة",
        "تدفئة", "تدفئه",
        "تسريب",
        "السقف",
        "صيانة",
        "كهرباء",

        "واي", "فاي",
        "wifi","Wi-Fi", "wi", "fi"
        "إنترنت", "انترنت",
        "النت", "ضعيف",

        "التطبيق","ابلكيشن","app",
        "لايعمل","لا", "يعمل",

        "إزعاج", "ازعاج",
        "ضوضاء",
        "ليلية", "ليليه",
        "عزل", "الصوت",
        "حفر",
        "النوم",
        "أيقظني", "ايقظني",

        "صراصير",
        "حشرات", "الحشرات", "حشر"
        "مياه", "صرف",
        "صحة", "صحه",
        "سلامة",

        "مدح", "ظاهري",
        "تجربة", "لا", "تنسى",
        "خدمة", "رائعة", "لكن",

        "موظف",
        "الموظف",
        "العاملين",
        "الاستقبال",
        "تعامل",
        "اسلوب", "وقح",
        "بطيء", "بطيئ",
        "احترافية", "احترافيه",
        "الخدمة",
    ],

    "positive_feedback": [
        "ممتاز", "ممتازه",
        "رائع", "رائعة",
        "استثنائي",
        "شكرا", "شكر",
        "متعاون",
        "جميل",
        "نظيف",
        "مريح",

        "إيجابي", "ايجابي",
        "اقتراح", "تحسين",
        "أحببت", "احببت",
        "أعجبني", "اعجبني",
        "تجربة", "جيدة",
        "تجربه", "جيده",
        "ساعود", "سأوصي", "ساوصي",
    ],

    "other": [
        "؟؟؟",
        "!!!",
        "فارغة", "فارغه",
        "واضح",
        "👎",
        "👍",
    ],
}